# Brewfile - Cross-platform dependencies (works on macOS and Linux)
# Install: brew bundle
# Update:  brew bundle --force cleanup

# ------------------------------------------------------------------------------
# Core CLI tools (git installed via system package manager)
# ------------------------------------------------------------------------------
brew "curl"
brew "wget"
brew "jq"
brew "fzf"
brew "ripgrep"      # rg - fast grep
brew "fd"           # fast find
brew "bat"          # cat with syntax highlighting
brew "eza"          # modern ls (successor to exa)
brew "zoxide"       # smarter cd
brew "tree"

# ------------------------------------------------------------------------------
# Development essentials (git, gcc, make installed via system package manager)
# ------------------------------------------------------------------------------
brew "neovim"
brew "tmux"
brew "stow"         # symlink manager for dotfiles

# ------------------------------------------------------------------------------
# Shell & prompt
# ------------------------------------------------------------------------------
brew "starship"     # cross-shell prompt (works in bash and zsh)
brew "atuin"        # cross-machine shell history sync

# ------------------------------------------------------------------------------
# Git enhancements
# ------------------------------------------------------------------------------
brew "lazygit"      # terminal UI for git
brew "delta"        # better git diffs
brew "gh"           # GitHub CLI

# ------------------------------------------------------------------------------
# Node.js / JavaScript
# ------------------------------------------------------------------------------
brew "node"
brew "typescript"
brew "typescript-language-server"

# ------------------------------------------------------------------------------
# PHP
# ------------------------------------------------------------------------------
brew "php"
brew "composer"

# ------------------------------------------------------------------------------
# Python
# ------------------------------------------------------------------------------
brew "python@3"
brew "pyright"      # Python LSP

# ------------------------------------------------------------------------------
# Rust
# ------------------------------------------------------------------------------
brew "rustup-init"  # installs rustc, cargo, rustfmt, clippy
brew "rust-analyzer"

# ------------------------------------------------------------------------------
# Go
# ------------------------------------------------------------------------------
brew "go"
brew "gopls"        # Go LSP

# ------------------------------------------------------------------------------
# Media / utilities
# ------------------------------------------------------------------------------
brew "ffmpeg"
brew "openssl"
brew "htop"
brew "btop"

# ------------------------------------------------------------------------------
# macOS only (casks)
# ------------------------------------------------------------------------------
# Uncomment on macOS:
# cask "iterm2"
# cask "font-jetbrains-mono-nerd-font"
# cask "phpstorm"

# ------------------------------------------------------------------------------
# Linux only
# These may need manual install via dnf/apt on Linux:
# - guake (terminal)
# - feh (image viewer)
# - phpactor (install via composer global require phpactor/phpactor)
# ------------------------------------------------------------------------------
